Repository: 84000/data-translation-memory
Catalog: toh163-v2.tmx
Source language: bo
Languages: en

source: སྟོན་པ་གང་ན་བཞུགས་པ་དང་། །ཆོས་ནི་གང་ན་འབར་བ་དེར། །འཇིག་རྟེན་ཁམས་ནི་ཐམས་ཅད་ནས། །བྱང་ཆུབ་སེམས་དཔའ་ཉེ་བར་ལྷགས། །
en: Bodhisattvas arrived From all worlds To the place where the Teacher was sitting And the Dharma was shining.

source: དེ་ལྟར་མཐའ་ཡས་དཔག་ཏུ་མེད། །བསམ་གྱིས་མི་ཁྱབ་མཆོད་པ་ནི། །རིན་ཆེན་དྲ་བ་ལིཙྪ་བཱི། །གཞོན་ནུ་དེ་ཡི་ཚེ་ན་བྱས། །
en: In this fashion, Ratnajālin, The young Licchavi, Performed boundless, Limitless, and inconceivable homage.

source: དེ་ནས་བདག་ཉིད་ཆེན་པོ་པ། །ལྷ་དང་ཀླུ་དང་མི་རྣམས་ཀྱིས། །མདུན་དུ་མི་མཆོག་ཤཱཀྱ་ཡི། །སེང་གེས་དབུགས་ནི་འབྱིན་པར་མཛད། །
en: Then the great person, The supreme human, the Lion of the Śākyas, Brought comfort to the assembled Gods, nāgas, and humans:

source: ང་ཡི་མདུན་དུ་འདུག་ནས་སུ། །ཁྱོད་ཀྱིས་འདི་འདྲའི་མཆོད་བྱས་པ། །གང་གཱའི་བྱེ་མ་ཇི་སྙེད་པ། །དེ་སྙེད་མཆོད་པ་དག་གིས་མཆོད། །
en: “Standing before me, You have performed such veneration. This veneration has been done with offerings As numerous as the grains of sand in the Ganges.

source: རིན་ཆེན་དྲ་བ་ཅན་གྱི་ཕྱིར། །མདོ་སྡེ་བཤད་པ་སུས་རིག་པ། །བྱང་ཆུབ་ལས་ནི་མི་ལྡོག་སྟེ། །
en: “Those who hear this discourse, Which has been taught for the sake of Ratnajālin, Shall not turn back from awakening;

source: སངས་རྒྱས་སྨྲ་བའི་མཆོག་ཏུ་འགྱུར། །
en: They will become supreme preachers of buddhahood.

source: གང་ཞིག་མདོ་སྡེ་འདི་འཛིན་པའི། །བསོད་ནམས་ཕུང་པོའི་ཚད་དག་ནི། །འདི་སྙེད་སོགས་པར་འགྱུར་རོ་ཞེས། །དེ་ལྟར་བཤད་པར་མི་ནུས་སོ། །
en: “One cannot describe The measure of the mass of merit That ensues from remembering this discourse By saying, ‘It shall be this much.’

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་ས་དང་ཆུ། །མེ་དང་རླུང་གི་ཚད་དག་ནི། །འདི་ཙམ་ཞེས་ནི་བཤད་པར་ནུས། །
en: “While one can describe the extent Of the earth, water, fire, and wind Throughout the ten directions,

source: བསོད་ནམས་ཕུང་པོ་བཤད་མི་ནུས། །
en: It is impossible to describe this mass of merit.

source: དགེ་སློང་ངམ་ནི་དགེ་སློང་མ། །དགེ་བསྙེན་འམ་ནི་དགེ་བསྙེན་མ། །གང་གིས་མདོ་སྡེ་འདི་ཐོས་ནས། །
en: “When a monk or nun, Or a novice monk or nun, Hears this discourse,

source: ལྷ་དང་ཀླུ་དང་ལྟོ་འཕྱེ་ཆེ། །སེམས་ཅན་ཐམས་ཅད་ཉེར་ལྷགས་པས། །དེ་ཡི་གཟི་བརྗིད་མི་བཟོད་དེ། །
en: All beings including gods, nāgas, and mahoragas “Will arrive near them And find their splendor overwhelming.

source: མེ་ནི་བསིལ་བར་འགྱུར་སྲིད་ཀྱི། །དེ་ཡི་གཟི་བརྗིད་ཉམས་པ་མེད། །
en: While it is possible that fire can turn cold, Their splendor will never diminish.

source: མདོ་སྡེ་འདི་ནི་གང་འཛིན་པ། །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པའི་ཚེ། །སེམས་ཅན་ཀུན་གྱིས་བསྟེན་བྱ་ཞིང་། །བྱང་ཆུབ་སེམས་ལའང་མཆོད་པ་བྱེད། །
en: “When someone who remembers this discourse Engages in the conduct of awakening, All beings will attend to them And venerate the mind of awakening.

source: གང་ཞིག་སྟོབས་དང་ལྡན་པའི་མིས། །བྱེ་བ་སྟོང་དུ་བཤད་པ་ཡི། །སྐྲ་རྩེས་སྟོང་གི་འཇིག་རྟེན་ཁམས། །བསྐལ་པ་བྱེ་བ་བཟུང་བ་བས། །
en: “A powerful person Might hold up a thousand worlds For millions of eons On the tip of a hair that has been split a billion times.

source: གང་ཞིག་ཕྱི་མའི་དུས་དག་ཏུ། །སངས་རྒྱས་བྱང་ཆུབ་གླེང་གཞི་ནི། །འདི་འདྲའི་རྣམ་པས་ཐོས་ནས་སུ། །གཞན་དག་ལ་ཡང་སྟོན་བྱེད་ན
en: during the latter days One may teach to others A discourse of the buddhas’ awakening That one has heard in this fashion.

source: གང་ཞིག་སྔར་ནི་རབ་བསྒྲགས་པ། །འདི་ཡི་ངོ་མཚར་ཆེན་པོ་ཡི། །བརྒྱ་དང་གྲངས་དང་བགྲང་བ་དང་། །དཔེར་ཡང་འགྱུར་བ་མ་ཡིན་ནོ། །
en: “In that case the great wonder Of the former example Shall not measure even a hundredth of that— As no number, figure, or example could suffice.

source: ཕྱི་མ་ཡི་ནི་དུས་དག་ཏུ། །འདི་འདྲའི་རྣམ་པ་སེང་གེའི་སྒྲ། །བསྟན་པ་བླ་མེད་ཐོས་གྱུར་ཀྱང་། །འགལ་མེད་དོན་མེད་འགྱུར་བར་འོང་། །
en: “In the latter days, When people hear the unsurpassed teachings Of the lion’s roar in this manner, It will not be contradicted or opposed.

source: འཇིག་རྟེན་མགོན་པོ་རྫོགས་སངས་རྒྱས། །འོད་མཛད་གང་གིས་འདིར་མཐོང་བ། །ཕྱི་མའི་དུས་སུ་དེས་ཐོས་ནས། །
en: “In the future, when people hear Of those who have seen the World Protector— The shining perfect Buddha—

source: ཞེ་ས་གུས་པར་བྱེད་པར་འགྱུར། །
en: They will act with respect and reverence.

source: གལ་ཏེ་ཞིང་རྣམས་བྱེ་བ་ན། །སེམས་ཅན་གང་དག་འཁོད་དེ་དག །སངས་རྒྱས་ཡེ་ཤེས་ལྡན་གྱུར་ལ། །གང་གཱ་ཡི་ནི་བྱེ་མ་སྙེད། །
en: “If all beings In millions of buddha realms Were endowed with the wisdom of buddhahood— As many of them as there are grains of sand in the Ganges—

source: བསྐལ་པ་དུ་མ་བརྒྱ་དག་ཏུ། །རིམ་གྲོ་དག་ནི་བྱེད་པ་དང་། །
en: “One might perform service to them For many hundreds of eons,

source: ཇི་ལྟར་སྟོང་ཆེན་གྱི་ནི་འཇིག་རྟེན་ཁམས། །དེ་སྙེད་དག་གི་གཙུག་ལག་ཁང་མཆོག་ནི། །དབུལ་བྱ་ལྷ་ཡི་ཙན་དན་དག་ལས་བྱས། །
en: And offer them as many fine temples As there are worlds in the great trichiliocosm. “The temples could be made of sandalwood;

source: ལྷ་ཡི་གཙུག་ལག་ཁང་མཆོག་རེ་རེ་ལའང་། །བྱེ་བ་ཕྲག་སྟོང་དག་གི་ཁང་བཟངས་བྱས། །
en: And each supreme and divine temple Would have ten billion assembly halls.

source: བྱེ་བ་ཕྲག་སྟོང་དག་གི་ཁང་བཟངས་ཀྱང་། །དབུལ་བྱ་ལྷ་ཡི་རིན་ཆེན་དག་ལས་བྱས། །རེ་རེའི་ཁྲི་དག་བཤམས་ནས་རིམ་གྲོ་པ། །བྱེ་བ་ཕྲག་བརྒྱ་ཤིན་ཏུ་ཚང་བར་བཀོད། །
en: “Each of the billion assembly halls Could be made from divine jewels as an offering. One could arrange thrones for everyone, Complete with a billion servants.

source: མཁས་པས་དེ་ནི་རིན་ཆེན་དྲ་བ་དག །བླངས་ནས་དེ་ཚེ་ཁྲི་དེ་བརྒྱན་པ་རྣམས། །
en: “Skillfully, one could take nets of jewels And adorn the thrones.

source: གང་གཱའི་བྱེ་སྙེད་བསྐལ་པ་བྱེ་བ་བརྒྱར། །ཐུབ་ཆེན་འཇིག་རྟེན་སྤྱོད་པ་བཞུགས་པ་ཡི། །
en: For eons as numerous as the grains of sand in the Ganges, The great sages who wander through the world could then abide there.

source: སངས་རྒྱས་གཅིག་ལ་འབུལ་བྱ་དབུལ་བ་དང་། །
en: “One could offer all that is fit to be offered To each of those buddhas.

source: ཇི་ལྟར་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད། །ཡོངས་སུ་མྱ་ངན་འདས་ཀྱི་མཆོད་རྟེན་བྱས། །
en: One could also create caityas for their parinirvāṇas As numerous as the grains of sand in the Ganges.

source: ཇི་ལྟར་སྟོང་ཆེན་འཇིག་རྟེན་ཁམས་རྣམས་སུ། །སངས་རྒྱས་གཅིག་གི་མཆོད་རྟེན་བྱས་པ་ནི། །རིན་ཆེན་རང་བཞིན་ལྷ་ཡི་སྒོ་སྟོང་ལྡན། །ཤིན་ཏུ་ལེགས་པར་སྲིད་པའི་རྩེ་སྲིད་མཐོ། །
en: “One could create a caitya to every single buddha In all the worlds of the great trichiliocosm— Composed of jewels, with thousands of divine doors, Reaching as high as the peak of existence.

source: ཇི་ལྟར་གང་གཱའི་ཀླུང་གི་བྱེ་སྙེད་ཀྱི། །གདུགས་ནི་མཆོད་རྟེན་གཅིག་ལ་འབུལ་བར་བྱེད། །
en: “One could offer parasols as numerous as the grains of sand in the Ganges To each of these caityas.

source: དེ་ཚེ་རེ་རེ་གདུགས་ལ་མུ་ཏིག་གི། །རྒྱན་ཕྲེང་བྱེ་བ་རྣམས་ཀྱང་ཤིན་ཏུ་བཀྲམ། །
en: The parasols offered at that time would be Covered with ornamental garlands of pearl.

source: ཇི་ལྟར་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད། །བྱེ་བའི་འཕན་དང་རིན་ཆེན་སྣ་ཚོགས་ཀྱི། །རྒྱལ་མཚན་བྱེ་བ་ཕྲག་བརྒྱ་གང་གཱ་ཡི། །བྱེ་སྙེད་མཆོད་རྟེན་དག་ལ་འབུལ་བར་བྱེད། །
en: “One could also offer millions of streamers As numerous as the grains of sand in the Ganges And billions of banners made of various precious jewels To these caityas as numerous as the grains of sand in the Ganges.

source: སྣང་བ་མཛད་པ་ཐམས་ཅད་མཁྱེན་གཅིག་གི། །མཆོད་རྟེན་གཅིག་ལ་སིལ་སྙན་བྱེ་བ་སྟོང་། །དཀྲོལ་ཅིང་
en: “One could play billions of instruments At each caitya of the omniscient illuminators.

source: གུས་པའི་མི་ནི་ས་ཡ་དག །བྱེ་བ་ཕྲག་སྟོང་ཚང་བ་འབུལ་བར་བྱེད། །
en: Trillions of respectful humans too Would join in making offerings.

source: མེ་ཏོག་གདུགས་བརྒྱ་དུ་མ་མཆོད་རྟེན་ལ་འབུལ་བ། །ཐུབ་པ་ཆེ་ལ་དེ་འདྲའི་མཆོད་པ་ཉིན་གཅིག་བཞིན། །གང་གཱའི་བྱེ་སྙེད་བསྐལ་པ་སྟོང་དུ་བྱེད་པ་བས། །
en: “They would offer hundreds of flowers and parasols to the caitya And venerate the great sages in this manner every day For as many eons as there are grains of sand in the Ganges.

source: གང་ཞིག་མདོ་སྡེ་འདི་ལས་ཚིགས་བཅད་གཅིག་ཐོས་ནསསོམ་ཉི་མེད་ཅིང་འདུན་པ་སྐྱེད་བྱེད་ལ། །རྒྱལ་བའི་མཚན་འདི་དག་ཀྱང་རྗོད་བྱེད་ན། །དེ་བས་བསོད་ནམས་འདི་ནི་བླ་མེད་མཆོག །
en: hearing just one verse from this discourse While not doubting it, developing interest, And reciting these victors’ names Brings merit that is unsurpassed and supreme.

source: མཁས་པ་ཏིང་ངེ་འཛིན་གྱི་མིང་ཐོས་ཤིང་། །ཚུལ་ཁྲིམས་སྐྱོན་མེད་མཚན་འདི་འཛིན་པ་དང་། །དེ་བཞིན་སངས་རྒྱས་ལ་ནི་མཆོད་བྱེད་པ། །
en: “Wise ones should listen to the names of absorptions, Maintain flawless discipline, remember these names, And venerate the thus-gone buddhas.

source: དེས་ནི་གང་གཱའི་བྱེ་སྙེད་སངས་རྒྱས་མཐོང་། །
en: Thereby, they will behold as many buddhas as the grains of sand in the Ganges.

source: ཐུབ་ཆེན་རྐང་གཉིས་མཆོག་གྱུར་དེ་དག་ལ། །མཆོད་པ་དམ་པའང་ཡིད་ཀྱིས་བྱས་ནས་
en: “Having directed their minds to the sacred veneration Of the supreme humans, the great sages,

source: ནི། །རྟག་ཏུ་མྱོས་མེད་ཆོས་ཀྱང་སྟོན་བྱེད་ཅིང་། །བསྐལ་པ་བྱེ་བ་དེ་ནི་རྨོངས་མེད་འགྱུར། །
en: They will always be sane, they will teach the Dharma, And for millions of eons they will remain undeluded.

source: འཇིག་རྟེན་མགོན་པོས་མདོ་མཆོག་རྒྱལ་པོ་འདི། །སྟོན་པའི་ཚེ་ན་གང་གིས་སྔོན་མཐོང་བ། །རྒྱལ་བ་མཆོག་ལས་འདི་ནི་ཐོས་གྱུར་ནས། །ཕྱི་མའི་དུས་སུ་དེ་ནི་དགའ་བས་འཛིན། །
en: “As the World Protector teaches This supreme king of discourses, Those who hear what the Supreme Victor has previously seen Will obtain happiness in the future.

source: དྲི་ང་ཕྱི་སའི་བུམ་པ་མིས་འདོར་ལྟར། །འདོད་པ་སྐྱོན་དུ་བགྲང་བ་སྤོང་བྱེད་ཅིང་། །
en: “They will discard desires, knowing them to have faults, Like a person tossing away a vessel filled with foul-smelling excrement.

source: མཁས་པ་ངེས་འབྱུང་ཞི་ལ་མངོན་དགའ་སྟེ། །རྟག་ཏུ་མྱོས་མེད་དགོན་པ་སྟེན་པར་བྱེད། །
en: Such wise beings will delight in emancipation and peace, Be constantly sane, and rely on the protectors.

source: ཡངས་པའི་གྲོང་ཁྱེར་མཆོག་ཏུ་གནས་ནས་སུ། །དེར་ནི་བཤད་ཚེ་གང་གིས་ང་མཐོང་ཞིང་། །དྲ་བའང་ང་ལ་མཆོད་བྱེད་མཐོང་བ་ནི། །ཕྱི་མའི་དུས་སུ་མདོ་མཆོག་འདི་འཛིན་ཏོ། །
en: “Those who saw me teach this In the city of Vaiśālī, Including Ratnajālin, who beheld and venerated me, Shall remember this supreme discourse in the future.

source: ངའི་བུ་གང་ཞིག་རྟག་ཏུ་རྗེས་འབྲང་ཞིང་། །བྱང་ཆུབ་ཞི་བ་སྤྱོད་མཆོག་སྤྱོད་པ་ན། །
en: “Those of my children who always follow me, Engage in the supreme acts of awakening and peace,

source: སེམས་ཅན་རྣམས་ནི་རྟག་ཏུ་འདུལ་བྱེད་པ། །ཕྱི་མའི་དུས་སུ་མདོ་མཆོག་འདི་འཛིན་ཏོ། །
en: And constantly train beings Shall uphold this supreme discourse in the future.

source: སངས་རྒྱས་འདྲེན་པ་གཞལ་མེད་དཔག་མེད་ཀྱི། །སྤྱད་པ་སྤྱོད་ཚེ་གང་གིས་རིམ་གྲོ་དང་། །དེ་བཞིན་མཆོད་པ་མཆོག་དག་བྱེད་པ་ནི། །དེ་ནི་ཕྱི་དུས་རྒྱལ་མཆོག་ཆོས་འཛིན་ཏོ། །
en: “Those who serve the buddhas, the guides, As they engage in the fathomless and incalculable practices, And likewise engage in perfect worship, Shall uphold this teaching of the Supreme Victor in the future.

source: གང་ཞིག་བསྐལ་པ་བྱེ་བར་ཚངས་སྤྱོད་ཅིང་། །འཇིག་རྟེན་མཐའ་ཡས་དོན་ནི་སྔར་སྤྱད་པ། །
en: “One could have engaged in pure conduct for a million eons Or previously worked for the benefit of infinite worlds;

source: གང་ཞིག་ཕྱི་མའི་དུས་སུ་མདོ་སྡེ་འདི། །ཐོས་པའི་བསོད་ནམས་གྲངས་སུ་འགྱུར་མ་ཡིན། །
en: Yet the merit of hearing this discourse in the future Shall not be countable at all.

source: སངས་རྒྱས་འཁྲུགས་མེད་ཡང་ན་ཚེ་དཔག་མེད། །སངས་རྒྱས་གཞལ་མེད་དཔག་མེད་དེ་དག་འདིར། །སེམས་ཅན་སྙིང་པོ་གང་གིས་མཐོང་འདོད་པ། །མདོ་སྡེ་མཛེས་པ་དཔག་མེད་བཟུང་བར་གྱིས། །
en: “Let those intelligent beings who desire to behold These peaceful and immortal buddhas— The unfathomable and limitless buddhas— Uphold the unfathomable greatness of this discourse!

source: ཚེ་དཔག་མེད་དང་མི་འཁྲུགས་དྲི་མེད་འོད། །སེང་གེ་དང་ནི་ཏོག་དང་དེ་བཞིན་དུ། །གང་ཞིག་སངས་རྒྱས་དེ་ཀུན་མཐོང་འདོད་པ། །ཕྱི་མའི་དུས་སུ་རྒྱལ་མཆོག་ཆོས་ཟུང་ཤིག །
en: “Let those who wish to behold all these buddhas, Including Amitāyus, Akṣobhya, Vimalaprabhā, and Siṃhaketu, Uphold this teaching of the Supreme Victor in the future!

source: སངས་རྒྱས་བྱམས་པ་དང་ནི་དྲི་མེད་འོད། །བདག་ཉིད་ཆེན་པོ་དང་ནི་སེང་གེ་ཏོག །རབ་སྣང་གཙོ་བོ་དེ་བཞིན་མཐོང་འདོད་པ། །དེ་ནི་ཕྱི་དུས་རྒྱལ་མཆོག་ཆོས་ཟུང་ཤིག །
en: “Let those who wish to behold these principle illuminators, The buddhas Maitreya and Vimalaprabhā, Mahātman, and Siṃhaketu, Uphold this teaching of the Supreme Victor in the future!

source: འདི་འདྲའི་མདོ་སྡེ་ཁྱད་པར་འཕགས་མཆོག་དག །རིན་ཆེན་དྲ་བ་ཅན་ལ་ང་ཡིས་བཤད། །
en: “I have taught this noble and supreme discourse to Ratnajālin.

source: ཕྱི་མའི་དུས་སུ་དེ་ཚེ་ཁྱོད་ཀྱིས་ནི། །བག་མེད་གནས་ལ་འདུག་པར་མ་བྱེད་ཅིག །
en: In the future, Do not stay in heedless places!

source: ཕྱི་མའི་དུས་ཀྱི་ཚེ་རུ་གྱུར་པ་ན། །ཚུལ་ཁྲིམས་སྐྱོན་མེད་རྟག་ཏུ་བག་བྱོས་དང་། །
en: “When the future times come, Be careful and always keep your discipline flawless.

source: དེ་ནས་ཁྱོད་ནི་འཆི་བའི་དུས་བྱས་ནས། །རྒྱལ་བ་འོད་ཟེར་མཐའ་ཡས་ཅན་གྱི་ཞིང་། །
en: Then, when your time comes to die, You will go to the realm of the victor Infinite Light.

source: རིན་ཆེན་ལྡན་ཞེས་བྱ་བའི་འཇིག་རྟེན་ཁམས། །སྟེང་གི་འཇིག་རྟེན་ཁམས་སུ་འགྲོ་བར་འགྱུར། །
en: “His realm is known as Jeweled, And is located in a world above us.

source: དེ་ནས་ཁྱོད་ནི་འཆི་བའི་དུས་བྱས་ནས། །མྱུར་བ་ཉིད་དུ་སངས་རྒྱས་བྱམས་པ་མཐོང་། །
en: Following that, when your time comes to die, You will swiftly behold the Buddha Maitreya.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་དང་། བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བཞི་བཅུ་དང་། དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་དང་། ལྷ་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་རྣམས་ཡི་རངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: Once the Blessed One gave this teaching, the young Licchavi Ratnajālin as well as four hundred million bodhisattvas such as Maitreya, and also six hundred million worthy ones and nine hundred ninety million gods rejoiced and praised what the Blessed One had said.

source: འཕགས་པ་རིན་ཆེན་དྲ་བ་ཅན་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སྷོ།། །།
en: This completes the Great Vehicle sūtra “The Questions of Ratnajālin.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛྙཱ་ན་གར་བྷ་དང་། ལོཙྪ་བ་བནྡེ་ཡེ་ཤེས་སྙིང་པོས་བསྒྱུར། ཞུས་ཆེན་གྱི་ལོཙྪ་བ་བནྡེ་དཔལ་བརྩེགས་ཀྱིས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: It was translated by the Indian scholar Jñānagarbha and the translator Venerable Yeshé Nyingpo.
